test/performance/marvelnft.yml
config:
  target: 'http://127.0.0.1:3000'
  phases:
    - duration: 20
      arrivalRate: 500
 
scenarios:
  - name: 'Test application health.'
    flow:
      - get:
          url: '/ping'
          expect:
            - statusCode: 200

  - name: 'Test singup route invalid data'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "teste.teste@test.com"
            password: "testando123"
          expect:
            - statusCode: 401

  - name: 'Test singup route valid data'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "marvel.nft@email.com"
            password: "superadmin"
          expect:
            - statusCode: 200
            - json:
                path: "$.accessToken"
                expect: ".*"
          save:
            - json: "$.accessToken"
              as: "accessToken"

  - name: 'Test balance routes'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "marvel.nft@email.com"
            password: "superadmin"
          expect:
            - statusCode: 200
            - json:
                path: "$.accessToken"
                expect: ".*"
          save:
            - json: "$.accessToken"
              as: "accessToken"

      - get:
          url: '/balance'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 403

      - post:
          url: '/balance/withdraw'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            value: "invalid_value"
          expect:
            - statusCode: 400

      - post:
          url: '/balance/deposit'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          json:
            value: "invalid_value"
          expect:
            - statusCode: 400

  - name: 'Test character routes'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "marvel.nft@email.com"
            password: "superadmin"
          expect:
            - statusCode: 200
            - json:
                path: "$.accessToken"
                expect: ".*"
          save:
            - json: "$.accessToken"
              as: "accessToken"

      - get:
          url: '/character'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 403

  - name: 'Test comic routes'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "marvel.nft@email.com"
            password: "superadmin"
          expect:
            - statusCode: 200
            - json:
                path: "$.accessToken"
                expect: ".*"
          save:
            - json: "$.accessToken"
              as: "accessToken"

      - get:
          url: '/comic'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 403

  - name: 'Test creator routes'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "marvel.nft@email.com"
            password: "superadmin"
          expect:
            - statusCode: 200
            - json:
                path: "$.accessToken"
                expect: ".*"
          save:
            - json: "$.accessToken"
              as: "accessToken"

      - get:
          url: '/creator'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 403

  - name: 'Test token routes'
    flow:
      - post:
          url: '/auth/signin'
          json:
            email: "marvel.nft@email.com"
            password: "superadmin"
          expect:
            - statusCode: 200
            - json:
                path: "$.accessToken"
                expect: ".*"
          save:
            - json: "$.accessToken"
              as: "accessToken"

      - get:
          url: '/token'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 403

      - get:
          url: '/token/mining'
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 403